paper/get_set_benchmark/raw/idlekv-get-set-9-1.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      6197371.43          ---          ---         2.84181         2.20700         9.21500        16.89500    471389.38 
Gets       688596.83    246820.65    441776.18         2.84637         2.22300         9.21500        16.89500     34345.93 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    6885968.26    246820.65    441776.18         2.84226         2.20700         9.21500        16.89500    505735.31 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.967        5.000
SET       1.143       10.000
SET       1.271       15.000
SET       1.383       20.000
SET       1.503       25.000
SET       1.615       30.000
SET       1.743       35.000
SET       1.879       40.000
SET       2.031       45.000
SET       2.207       50.000
SET       2.319       52.500
SET       2.431       55.000
SET       2.559       57.500
SET       2.687       60.000
SET       2.831       62.500
SET       2.991       65.000
SET       3.167       67.500
SET       3.343       70.000
SET       3.535       72.500
SET       3.727       75.000
SET       3.839       76.250
SET       3.951       77.500
SET       4.063       78.750
SET       4.191       80.000
SET       4.319       81.250
SET       4.447       82.500
SET       4.575       83.750
SET       4.703       85.000
SET       4.863       86.250
SET       5.023       87.500
SET       5.087       88.125
SET       5.183       88.750
SET       5.279       89.375
SET       5.375       90.000
SET       5.471       90.625
SET       5.599       91.250
SET       5.695       91.875
SET       5.823       92.500
SET       5.951       93.125
SET       6.079       93.750
SET       6.175       94.062
SET       6.239       94.375
SET       6.335       94.688
SET       6.431       95.000
SET       6.527       95.312
SET       6.623       95.625
SET       6.719       95.938
SET       6.847       96.250
SET       6.975       96.562
SET       7.135       96.875
SET       7.199       97.031
SET       7.295       97.188
SET       7.359       97.344
SET       7.455       97.500
SET       7.583       97.656
SET       7.679       97.812
SET       7.807       97.969
SET       7.935       98.125
SET       8.095       98.281
SET       8.319       98.438
SET       8.383       98.516
SET       8.511       98.594
SET       8.575       98.672
SET       8.703       98.750
SET       8.831       98.828
SET       9.023       98.906
SET       9.151       98.984
SET       9.343       99.062
SET       9.535       99.141
SET       9.727       99.219
SET       9.855       99.258
SET      10.047       99.297
SET      10.175       99.336
SET      10.303       99.375
SET      10.495       99.414
SET      10.687       99.453
SET      10.879       99.492
SET      11.135       99.531
SET      11.455       99.570
SET      11.711       99.609
SET      11.903       99.629
SET      12.095       99.648
SET      12.287       99.668
SET      12.479       99.688
SET      12.735       99.707
SET      12.927       99.727
SET      13.183       99.746
SET      13.503       99.766
SET      13.759       99.785
SET      14.079       99.805
SET      14.271       99.814
SET      14.463       99.824
SET      14.655       99.834
SET      14.911       99.844
SET      15.103       99.854
SET      15.359       99.863
SET      15.743       99.873
SET      16.127       99.883
SET      16.639       99.893
SET      17.023       99.902
SET      17.151       99.907
SET      17.407       99.912
SET      17.663       99.917
SET      17.919       99.922
SET      18.175       99.927
SET      18.559       99.932
SET      18.943       99.937
SET      19.327       99.941
SET      19.711       99.946
SET      20.095       99.951
SET      20.223       99.954
SET      20.479       99.956
SET      20.735       99.958
SET      20.991       99.961
SET      21.247       99.963
SET      21.503       99.966
SET      21.759       99.968
SET      22.143       99.971
SET      22.527       99.973
SET      22.911       99.976
SET      23.295       99.977
SET      23.551       99.978
SET      23.935       99.979
SET      24.191       99.980
SET      24.447       99.982
SET      24.703       99.983
SET      25.087       99.984
SET      25.343       99.985
SET      26.111       99.987
SET      26.751       99.988
SET      26.879       99.988
SET      27.007       99.989
SET      27.391       99.990
SET      27.647       99.990
SET      27.903       99.991
SET      28.159       99.991
SET      28.415       99.992
SET      28.671       99.993
SET      29.055       99.993
SET      29.311       99.994
SET      29.695       99.994
SET      29.823       99.995
SET      30.335       99.995
SET      30.975       99.995
SET      31.615       99.995
SET      32.127       99.996
SET      32.383       99.996
SET      33.023       99.996
SET      33.279       99.997
SET      33.279       99.997
SET      33.535       99.997
SET      33.535       99.997
SET      33.791       99.997
SET      34.047       99.998
SET      34.815       99.998
SET      35.583       99.998
SET      35.839       99.998
SET      36.351       99.998
SET      37.119       99.998
SET      37.119       99.998
SET      37.375       99.999
SET      37.375       99.999
SET      37.631       99.999
SET      37.887       99.999
SET      38.143       99.999
SET      38.399       99.999
SET      38.399       99.999
SET      38.911       99.999
SET      39.423       99.999
SET      39.935       99.999
SET      40.447       99.999
SET      40.447       99.999
SET      42.751       99.999
SET      43.007       99.999
SET      43.263       99.999
SET      43.519       99.999
SET      43.519      100.000
SET      43.519      100.000
SET      43.519      100.000
[...]
SET      43.775      100.000
SET      43.775      100.000
SET      43.775      100.000
[...]
SET      44.031      100.000
SET      44.031      100.000
SET      44.031      100.000
[...]
SET      44.287      100.000
SET      44.287      100.000
SET      44.287      100.000
[...]
SET      44.799      100.000
SET      44.799      100.000
SET      44.799      100.000
[...]
SET      45.055      100.000
SET      45.055      100.000
---
GET       0.023        0.000
GET       0.975        5.000
GET       1.143       10.000
GET       1.271       15.000
GET       1.391       20.000
GET       1.503       25.000
GET       1.623       30.000
GET       1.743       35.000
GET       1.879       40.000
GET       2.031       45.000
GET       2.223       50.000
GET       2.319       52.500
GET       2.431       55.000
GET       2.559       57.500
GET       2.687       60.000
GET       2.847       62.500
GET       3.007       65.000
GET       3.167       67.500
GET       3.359       70.000
GET       3.535       72.500
GET       3.743       75.000
GET       3.839       76.250
GET       3.951       77.500
GET       4.063       78.750
GET       4.191       80.000
GET       4.319       81.250
GET       4.447       82.500
GET       4.575       83.750
GET       4.703       85.000
GET       4.863       86.250
GET       5.023       87.500
GET       5.119       88.125
GET       5.183       88.750
GET       5.279       89.375
GET       5.375       90.000
GET       5.503       90.625
GET       5.599       91.250
GET       5.727       91.875
GET       5.823       92.500
GET       5.951       93.125
GET       6.111       93.750
GET       6.175       94.062
GET       6.271       94.375
GET       6.335       94.688
GET       6.431       95.000
GET       6.527       95.312
GET       6.623       95.625
GET       6.751       95.938
GET       6.847       96.250
GET       6.975       96.562
GET       7.135       96.875
GET       7.199       97.031
GET       7.295       97.188
GET       7.391       97.344
GET       7.487       97.500
GET       7.583       97.656
GET       7.711       97.812
GET       7.839       97.969
GET       7.967       98.125
GET       8.127       98.281
GET       8.319       98.438
GET       8.383       98.516
GET       8.511       98.594
GET       8.639       98.672
GET       8.767       98.750
GET       8.895       98.828
GET       9.023       98.906
GET       9.151       98.984
GET       9.343       99.062
GET       9.535       99.141
GET       9.791       99.219
GET       9.919       99.258
GET      10.047       99.297
GET      10.175       99.336
GET      10.367       99.375
GET      10.495       99.414
GET      10.687       99.453
GET      10.943       99.492
GET      11.135       99.531
GET      11.455       99.570
GET      11.775       99.609
GET      11.903       99.629
GET      12.095       99.648
GET      12.287       99.668
GET      12.479       99.688
GET      12.735       99.707
GET      12.927       99.727
GET      13.183       99.746
GET      13.503       99.766
GET      13.759       99.785
GET      14.079       99.805
GET      14.271       99.814
GET      14.463       99.824
GET      14.655       99.834
GET      14.911       99.844
GET      15.103       99.854
GET      15.359       99.863
GET      15.743       99.873
GET      16.127       99.883
GET      16.639       99.893
GET      17.023       99.902
GET      17.151       99.907
GET      17.407       99.912
GET      17.663       99.917
GET      17.919       99.922
GET      18.175       99.927
GET      18.559       99.932
GET      18.943       99.937
GET      19.327       99.941
GET      19.711       99.946
GET      20.095       99.951
GET      20.223       99.954
GET      20.479       99.956
GET      20.735       99.958
GET      20.991       99.961
GET      21.247       99.963
GET      21.503       99.966
GET      21.759       99.968
GET      22.143       99.971
GET      22.527       99.973
GET      22.911       99.976
GET      23.295       99.977
GET      23.551       99.978
GET      23.935       99.979
GET      24.191       99.980
GET      24.447       99.982
GET      24.703       99.983
GET      25.087       99.984
GET      25.343       99.985
GET      25.983       99.987
GET      26.623       99.988
GET      26.879       99.988
GET      27.007       99.989
GET      27.391       99.990
GET      27.647       99.990
GET      27.775       99.991
GET      28.159       99.991
GET      28.415       99.992
GET      28.671       99.993
GET      29.055       99.993
GET      29.311       99.994
GET      29.567       99.994
GET      29.823       99.995
GET      30.079       99.995
GET      30.847       99.995
GET      31.615       99.995
GET      31.999       99.996
GET      32.383       99.996
GET      33.023       99.996
GET      33.279       99.997
GET      33.279       99.997
GET      33.535       99.997
GET      33.535       99.997
GET      33.791       99.997
GET      34.047       99.998
GET      34.559       99.998
GET      35.583       99.998
GET      35.839       99.998
GET      36.351       99.998
GET      37.119       99.998
GET      37.119       99.998
GET      37.375       99.999
GET      37.375       99.999
GET      37.631       99.999
GET      37.887       99.999
GET      37.887       99.999
GET      38.399       99.999
GET      38.399       99.999
GET      38.655       99.999
GET      39.423       99.999
GET      39.935       99.999
GET      39.935       99.999
GET      40.447       99.999
GET      40.447       99.999
GET      43.007       99.999
GET      43.263       99.999
GET      43.519       99.999
GET      43.519      100.000
GET      43.519      100.000
GET      43.519      100.000
[...]
GET      43.775      100.000
GET      43.775      100.000
GET      43.775      100.000
[...]
GET      44.031      100.000
GET      44.031      100.000
GET      44.031      100.000
[...]
GET      44.287      100.000
GET      44.287      100.000
GET      44.287      100.000
[...]
GET      44.799      100.000
GET      44.799      100.000
GET      44.799      100.000
[...]
GET      45.055      100.000
GET      45.055      100.000
---
WAIT      0.000      100.000